// 1. Создание коллекции "users" и добавление 4 документов
db.users.insertMany([
    { _id: 1, name: "Анатолий", age: 28, gender: "m" },
    { _id: 2, name: "Светлана", age: 25, gender: "f" },
    { _id: 3, name: "Никита", age: 33, gender: "m" },
    { _id: 4, name: "Ольга", age: 22, gender: "f" }
  ]);
  
  // 2. Вывод данных о всех представительницах женского пола
  db.users.find({ gender: "f" });
  
  // 3. Вывод данных о всех представительницах женского пола и людях старше 30 лет
  db.users.find({ $or: [{ gender: "f" }, { age: { $gt: 30 } }] });
  
  // 4. Вывод всех пользователей, у которых имя входит в список (Анатолий, Дмитрий, Ольга, Семен)
  db.users.find({ name: { $in: ["Анатолий", "Дмитрий", "Ольга", "Семен"] } });
  
  // 5. Вывод пользователя с идентификатором 3
  db.users.findOne({ _id: 3 });
  
  // 6. Вывод пользователей в возрасте от 30 до 40 (включая концы)
  db.users.find({ age: { $gte: 30, $lte: 40 } });
  